app/controllers/manage_controller.rb

  def index
    if !params[:user].nil?
      # The form was submitted
      user_returned = User.find_by(:username => params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "TCrammer"]]

  def create
    post_buffer = params[:blog_post]
    if !post_buffer.nil?
      # The title is not empty
      new_post = BlogPost.new
      new_post.title = post_buffer[:title]
      # Trim whitespace and add an array of tags to the :tags property
      new_post_tags = Array.new
      post_buffer[:tags].split(',').each do |tag|
        tag.strip!
        new_post_tags.push(tag)
---
INSERT INTO "blog_posts" ("title", "tags", "file_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def delete
    @latest_posts = BlogPost.paginate({
      :page => params[:page],
      :per_page => 30
      }).order('created_at DESC') # The default is 5; Using the 'will_paginate' gem
---
SELECT  "blog_posts".* FROM "blog_posts"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "blog_posts"

  def destroy_post
    if session[:authenticated_user] != nil
      post_to_destroy = BlogPost.find(params[:id])
      post_path = "public/full_posts/_#{post_to_destroy.file_name}.html.erb"
      header_image_path = "public/images/post-header-images/#{post_to_destroy.file_name}.jpg"

      # Delete the post from the database
      post_to_destroy.delete
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 5]]