app/controllers/manage_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def delete
    @posts = BlogPost.all

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT 1  [["id", 3]]
---
  def bye
    @post = BlogPost.find(params[:id])