app/controllers/my_work_controller.rb

  def index
    @current_year = Date.today.strftime("%Y")
    @latest_posts = BlogPost.page(params[:page]).order('created_at DESC') # The default is 5; Using the 'will_paginate' gem
---
SELECT  "blog_posts".* FROM "blog_posts"  ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "blog_posts"