app/controllers/posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 1]]
---
  def with_id
    @post = BlogPost.where(:id => params[:id])[0] # Fetch the requested post